flatpak.org
#+TITLE: Flatpak Loom: Literate & Reproducible
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:text :comments no
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Purpose
Reproducible Flatpak state from your dotfiles, Guix style. One manifest file is the source of truth. Each line declares origin, id, branch, and scope. Scope is either =user= or =system=. The apply step is additive by default; exact enforcement with removals is opt in.

* Flatpak single manifest
Columns: ORIGIN, ID, BRANCH, SCOPE. Comments and blanks allowed.
#+BEGIN_SRC text :tangle linux/.flatpak/manifest/apps.ssv
# origin id branch scope
flathub com.github.tchx84.Flatseal stable user
flathub app.zen_browser.zen stable user
flathub cc.arduino.IDE2	stable user
flathub com.discordapp.Discord stable user
flathub com.github.qarmin.czkawka stable user
flathub com.leinardi.gwe stable user
flathub com.logseq.Logseq stable user
flathub com.rustdesk.RustDesk stable user
flathub com.vscodium.codium stable user
flathub io.github.qwersyk.Newelle stable user
flathub io.github.ungoogled_software.ungoogled_chromium	stable user
flathub io.github.webcamoid.Webcamoid stable user
flathub md.obsidian.Obsidian stable user
flathub net.davidotek.pupgui2 stable user
flathub net.rpcs3.RPCS3	stable user
flathub one.ablaze.floorp stable user
flathub org.duckstation.DuckStation stable user
flathub org.freac.freac stable user
flathub org.jdownloader.JDownloader stable user
flathub org.keepassxc.KeePassXC stable user
flathub org.ppsspp.PPSSPP stable user
flathub org.telegram.desktop stable user
flathub org.upscayl.Upscayl stable user
flathub us.zoom.Zoom stable user
flathub de.leopoldluley.Clapgrep stable user
flathub io.github.josephmawa.Bella stable user
flathub org.zotero.Zotero stable user
flathub net.xmind.XMind stable user
flathub io.github.sithlord48.blackchocobo stable user
flathub com.github.Flacon stable user
flathub org.garudalinux.firedragon stable user
flathub io.github.flattool.Warehouse stable user
# flathub com.github.marktext.marktext stable user
flathub me.mitya57.ReText stable user
# flathub org.kde.ghostwriter stable user
flathub io.github.dgsasha.Remembrance stable user
flathub org.musicbrainz.Picard stable user
flathub io.mgba.mGBA stable user
flathub org.wezfurlong.wezterm stable user
flathub	org.freedesktop.Sdk 23.08 user
flathub net.pcsx2.PCSX2 stable user
flathub eu.betterbird.Betterbird stable user
flathub org.atheme.audacious stable user
flathub com.moonlight_stream.Moonlight user
# pied-origin com.mikeasoft.pied master user
#+END_SRC

* Remotes setup
Idempotent helper to ensure remotes exist before applying the manifest. Adjust the Pied URL if you use a custom one.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-remotes-setup :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

unset_ssl() { unset SSL_CERT_FILE SSL_CERT_DIR CURL_CA_BUNDLE GIT_SSL_CAINFO; }

add_remote() {
  local scope="$1" name="$2" url="$3"
  unset_ssl
  if [ "$scope" = "system" ]; then
    if flatpak remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak remote-add --if-not-exists --from "$name" "$f"
    fi
  else
    if flatpak --user remote-list --columns=name | grep -qx "$name"; then return 0; fi
    if ! "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists "$name" "$url"; then
      mkdir -p "$HOME/.cache/flatpak-remotes"
      local f="$HOME/.cache/flatpak-remotes/${name}.flatpakrepo"
      curl -fsSL "$url" -o "$f"
      "${CLEAN_ENV[@]}" flatpak --user remote-add --if-not-exists --from "$name" "$f"
    fi
  fi
}

# Flathub for both scopes
add_remote system flathub https://dl.flathub.org/repo/flathub.flatpakrepo
add_remote user   flathub https://dl.flathub.org/repo/flathub.flatpakrepo

# Pied: set the real URL if you have one (placeholder keeps idempotence)
if ! flatpak remote-list --columns=name | grep -qx pied-origin; then
  add_remote system pied-origin https://dl.flathub.org/repo/flathub.flatpakrepo || true
fi
#+END_SRC

* Make targets
Include directly with =make -f all/.mk/flatpak.mk <target>= or add to your main Makefile with =-include all/.mk/flatpak.mk=.
#+BEGIN_SRC makefile :tangle all/.mk/flatpak.mk :padline no :comments none
# Flatpak Make targets fragment. Requires GNU Make 3.82+.
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: flatpak-remotes flatpak-capture flatpak-diff flatpak-sync flatpak-apply flatpak-perms-capture flatpak-perms-apply flatpak-bridge flatpak-bridge-reset

flatpak-remotes:
| @chmod +x $(HOME)/.local/bin/flatpak-remotes-setup 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-remotes-setup

flatpak-capture:
| @chmod +x $(HOME)/.local/bin/flatpak-capture 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-capture

flatpak-diff:
| @chmod +x $(HOME)/.local/bin/flatpak-diff 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-diff

# Additive only: installs + updates, no removals
flatpak-sync: flatpak-remotes
| @chmod +x $(HOME)/.local/bin/flatpak-apply 2>/dev/null || true
| ENFORCE=-1 UNINSTALL=-1 $(HOME)/.local/bin/flatpak-apply

# Default apply: enforce installs+updates; removals must be explicit (UNINSTALL=1)
flatpak-apply: flatpak-remotes
| @chmod +x $(HOME)/.local/bin/flatpak-apply 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-apply

flatpak-perms-capture:
| @chmod +x $(HOME)/.local/bin/flatpak-perms-capture 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-perms-capture

flatpak-perms-apply:
| @chmod +x $(HOME)/.local/bin/flatpak-perms-apply 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-perms-apply

flatpak-bridge:
| @chmod +x $(HOME)/.local/bin/flatpak-desktop-bridge 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-desktop-bridge

flatpak-bridge-reset:
| @chmod +x $(HOME)/.local/bin/flatpak-desktop-bridge-reset 2>/dev/null || true
| $(HOME)/.local/bin/flatpak-desktop-bridge-reset
#+END_SRC

* Capture live state into the manifest
Merges your current user and system apps into =apps.ssv=. Keeps comments. Does not remove existing lines.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-capture :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail
OUT="${HOME}/DotCortex/linux/.flatpak/manifest/apps.ssv"

# Run flatpak in a clean env to avoid SSL/Guix contamination
CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

dump_scope() { # user|system
  local scope="$1"
  if [ "$scope" = user ]; then
    "${CLEAN_ENV[@]}" flatpak --user list --app --columns=origin,application,branch
  else
    "${CLEAN_ENV[@]}" flatpak --system list --app --columns=origin,application,branch
  fi | awk -v s="$scope" '
    NF>=3 { printf "%s %s %s %s\n", $1, $2, $3, s }
  '
}

tmp="$(mktemp)"; trap 'rm -f "$tmp"' EXIT

{
  # keep comments / blanks
  [ -f "$OUT" ] && grep -E '^\s*#|^\s*$' "$OUT" || true
  # merge existing data + fresh dumps, uniq
  {
    [ -f "$OUT" ] && grep -Ev '^\s*#|^\s*$' "$OUT" || true
    dump_scope user
    dump_scope system
  } | awk 'NF>=4 {print $1, $2, $3, $4}' | sort -u
} > "$tmp"

mv "$tmp" "$OUT"
echo "Wrote $OUT"
#+END_SRC

* Diff plan
Shows what would be installed and what would be removed to match the manifest.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-diff :shebang "#!/usr/bin/env bash"
set -euo pipefail
MAN="${HOME}/DotCortex/linux/.flatpak/manifest/apps.ssv"

desired_ids(){ awk '$0!~/^#/ && NF>=4{print $2, $4}' "$MAN" | sort -u; }
installed_ids(){
  { flatpak --user list --app --columns=application | awk 'NF{print $1, "user"}'
    flatpak --system list --app --columns=application | awk 'NF{print $1, "system"}'; } \
 \
  | sort -u
}

d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' EXIT
desired_ids >"$d"; installed_ids >"$i"

# desired minus installed -> to install
echo "[plan] to install:"
join -v1 <(cut -d' ' -f1 "$d") <(cut -d' ' -f1 "$i") \
  | while read -r id; do grep -F "$id" "$d" | sed 's/^/  + /'; done || true

# installed minus desired -> to uninstall
echo "[plan] to uninstall:"
join -v1 <(cut -d' ' -f1 "$i") <(cut -d' ' -f1 "$d") \
  | while read -r id; do grep -F "$id" "$i" | sed 's/^/  - /'; done || true
#+END_SRC

* Apply manifest with safe elevation
Default behavior: **enforce exact state** (install + update + uninstall).
System-scoped actions try Polkit first; if denied, retry the specific command with sudo.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-apply :shebang "#!/usr/bin/env bash"
# ~/.local/bin/flatpak-apply  (tangle this from flatpak.org)
#!/usr/bin/env bash
set -euo pipefail

MAN="${HOME}/DotCortex/linux/.flatpak/manifest/apps.ssv"

# defaults: installs + updates; removals only if UNINSTALL=1
ENFORCE="${ENFORCE:-1}"
UNINSTALL="${UNINSTALL:-1}"
UPDATE="${UPDATE:-1}"
FORCE_SUDO_SYSTEM="${FORCE_SUDO_SYSTEM:-0}"
DEBUG="${DEBUG:-0}"

[ "$DEBUG" = 1 ] && set -x

# clean env
CLEAN_LANG="${LANG:-C.UTF-8}"
CLEAN_TERM="${TERM:-xterm-256color}"
CLEAN_PATH="/usr/sbin:/usr/bin:/bin:${HOME}/.local/bin"
CLEAN_ENV=(env -i HOME="$HOME" PATH="$CLEAN_PATH"
  LANG="$CLEAN_LANG" LC_ALL="$CLEAN_LANG"
  TERM="$CLEAN_TERM"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")
tab=$'\t'
FS='[[:space:]]+'
unset_ssl(){ unset SSL_CERT_FILE SSL_CERT_DIR CURL_CA_BUNDLE GIT_SSL_CAINFO; }

ensure_remotes(){
  local helper="$HOME/.local/bin/flatpak-remotes-setup"
  [ -x "$helper" ] && "${CLEAN_ENV[@]}" "$helper" || true
}

run_fp(){ local scope="$1"; shift; unset_ssl
  if [ "$scope" = system ] && [ "$FORCE_SUDO_SYSTEM" = 1 ]; then
    sudo "${CLEAN_ENV[@]}" flatpak "$@"; return
  fi
  if "${CLEAN_ENV[@]}" flatpak "$@"; then return; fi
  if [ "$scope" = system ]; then
    echo "Retrying with sudo: flatpak $*" >&2
    sudo "${CLEAN_ENV[@]}" flatpak "$@"
  fi
}

# ----- parsing & plan (normalize to TAB-delimited) -----
desired_pairs(){
  awk -v FS="$FS" -v OFS="$tab" '$0!~/^#/ && NF>=4{print $2,$4}' "$MAN" | sort -u
}
installed_pairs(){
  { "${CLEAN_ENV[@]}" flatpak --user   list --app --columns=application | awk -v OFS="$tab" 'NF{print $1,"user"}'
    "${CLEAN_ENV[@]}" flatpak --system list --app --columns=application | awk -v OFS="$tab" 'NF{print $1,"system"}'; } \
  | sort -u
}

print_plan(){
  local d i; d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' RETURN
  desired_pairs >"$d"; installed_pairs >"$i"
  echo "== Plan =="
  echo "[to install]"
  join -v1 -t "$tab" <(cut -f1 "$d") <(cut -f1 "$i") | sed 's/^/  + /' || true
  echo "[to uninstall]"
  join -v1 -t "$tab" <(cut -f1 "$i") <(cut -f1 "$d") | sed 's/^/  - /' || true
}

already_installed(){ # id scope
  if [ "$2" = user ]; then "${CLEAN_ENV[@]}" flatpak --user   list --app --columns=application | grep -qx "$1"
  else                           "${CLEAN_ENV[@]}" flatpak --system list --app --columns=application | grep -qx "$1"
  fi
}

apply_installs(){
  echo "== Installing =="
  awk -v FS="$FS" '$0!~/^#/ && NF>=4{printf "  manifest: origin=%s id=%s branch=%s scope=%s\n",$1,$2,$3,$4}' "$MAN" || true

  awk -v FS="$FS" -v OFS="$tab" '$0!~/^#/ && NF>=4{print $1,$2,$3,$4}' "$MAN" |
  while read -r origin id branch scope; do
    [ -n "$origin$id$branch$scope" ] || continue
    already_installed "$id" "$scope" && continue
    echo "  -> installing $id ($scope) from $origin:$branch"
    args=(install -y); [ "$scope" = user ] && args+=(--user) || args+=(--system)
    run_fp "$scope" "${args[@]}" "$origin" "$id" "$branch"
  done
}

update_manifested(){
  [ "$UPDATE" = 1 ] || return 0
  echo "== Updating =="
  mapfile -t IDS_USER < <(awk -v FS="$FS" '$0!~/^#/ && NF>=4 && $4=="user"{print $2}' "$MAN" | sort -u)
  if [ "${#IDS_USER[@]}" -gt 0 ]; then
    "${CLEAN_ENV[@]}" flatpak --user update -y "${IDS_USER[@]}" || true
  fi

  mapfile -t IDS_SYS  < <(awk -v FS="$FS" '$0!~/^#/ && NF>=4 && $4=="system"{print $2}' "$MAN" | sort -u)
  if [ "${#IDS_SYS[@]}" -gt 0 ]; then
    run_fp system update -y "${IDS_SYS[@]}" || true
  fi
}

compute_extras(){ # installed-not-desired (id<TAB>scope)
  local d i; d="$(mktemp)"; i="$(mktemp)"; trap 'rm -f "$d" "$i"' RETURN
  desired_pairs >"$d"; installed_pairs >"$i"
  join -v2 -t "$tab" <(cut -f1 "$d") "$i" || true
}

apply_uninstalls(){
  [ "$ENFORCE" = 1 ] && [ "$UNINSTALL" = 1 ] || return 0
  echo "== Uninstalling extras =="
  compute_extras | while read -r id scope; do
    [ -n "${id:-}" ] || continue
    echo "  -> uninstalling $id ($scope)"
    if [ "$scope" = user ]; then
      "${CLEAN_ENV[@]}" flatpak --user uninstall -y "$id" || true
    else
      "${CLEAN_ENV[@]}" flatpak --system uninstall -y "$id" || true
    fi
  done
}

ensure_remotes
print_plan
apply_installs
update_manifested
apply_uninstalls
echo "Done."
#+END_SRC

** Flatpak env file
So Flatpak apps register with your desktop without hacks.
#+BEGIN_SRC conf :tangle linux/.config/environment.d/30-flatpak-exports.conf :mkdirp yes
XDG_DATA_DIRS=/usr/local/share:/usr/share:$HOME/.local/share/flatpak/exports/share:/var/lib/flatpak/exports/share
#+END_SRC

** Reproducible Flatpak permissions & overrides
Store exact per-app permissions from your machine and re-apply them anywhere.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-perms-capture :shebang "#!/usr/bin/env bash" :mkdirp yes
#!/usr/bin/env bash
set -euo pipefail

BASE="${HOME}/DotCortex/linux/.flatpak/overrides-perms"
mkdir -p "$BASE"

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  LANG="${LANG:-C.UTF-8}" LC_ALL="${LC_ALL:-C.UTF-8}" TERM="${TERM:-xterm-256color}"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

awk '$0!~/^#/ && NF>=4 {print $2}' "$HOME/DotCortex/linux/.flatpak/manifest/apps.ssv" \
  | sort -u \
  | while read -r app; do
      out="$BASE/$app.perms"

      # Do not let a single failure kill the whole capture run
      if ! "${CLEAN_ENV[@]}" flatpak info --show-permissions "$app" >"$out" 2>/dev/null; then
        rm -f "$out"
        continue
      fi

      # Some apps may have no overrides at all, skip empty files
      if [ ! -s "$out" ]; then
        rm -f "$out"
        continue
      fi

      echo "wrote $out"
    done
#+END_SRC

