linux/.local/bin/flatpak-perms-capture
#!/usr/bin/env bash
# Reproducible Flatpak permissions & overrides
# Store exact per-app permissions from your machine and re-apply them anywhere.

# [[file:../../../flatpak.org::*Reproducible Flatpak permissions & overrides][Reproducible Flatpak permissions & overrides:1]]
#!/usr/bin/env bash
set -euo pipefail

BASE="${HOME}/DotCortex/linux/.flatpak/overrides-perms"
mkdir -p "$BASE"

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  LANG="${LANG:-C.UTF-8}" LC_ALL="${LC_ALL:-C.UTF-8}" TERM="${TERM:-xterm-256color}"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

awk '$0!~/^#/ && NF>=4 {print $2}' "$HOME/DotCortex/linux/.flatpak/manifest/apps.ssv" \
  | sort -u \
  | while read -r app; do
      out="$BASE/$app.perms"

      # Do not let a single failure kill the whole capture run
      if ! "${CLEAN_ENV[@]}" flatpak info --show-permissions "$app" >"$out" 2>/dev/null; then
        rm -f "$out"
        continue
      fi

      # Some apps may have no overrides at all, skip empty files
      if [ ! -s "$out" ]; then
        rm -f "$out"
        continue
      fi

      echo "wrote $out"
    done
# Reproducible Flatpak permissions & overrides:1 ends here
