flatpak.org
** Apply script (maps the common fields → flatpak override)
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-perms-apply :shebang "#!/usr/bin/env bash" :mkdirp yes
set -euo pipefail
BASE="${HOME}/DotCortex/linux/.flatpak/overrides-perms"

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  LANG="${LANG:-C.UTF-8}" LC_ALL="${LC_ALL:-C.UTF-8}" TERM="${TERM:-xterm-256color}"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

apply_app(){
  local app="$1" f="$BASE/$1.perms"
  [ -f "$f" ] || { echo "skip $app (no $f)"; return 0; }

  # Build override flags from sections
  awk -v app="$app" '
    function splitcsv(s, arr){ gsub(/ /,"",s); n=split(s,arr,/[,;]/); return n }
    BEGIN{ sec=""; }
    /^\[/ { gsub(/[\[\]]/,""); sec=$0; next }
    /^[[:space:]]*$/ { next }
    { line=$0 }
    sec=="Context" {
      if (line ~ /^sockets=/) {
        sub(/^sockets=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--socket=%s\n", a[i];
      } else if (line ~ /^devices=/) {
        sub(/^devices=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--device=%s\n", a[i];
      } else if (line ~ /^filesystems=/) {
        sub(/^filesystems=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--filesystem=%s\n", a[i];
      } else if (line ~ /^persistent=/) {
        sub(/^persistent=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--persist=%s\n", a[i];
      } else if (line ~ /^features=/) {
        sub(/^features=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--enable-features=%s\n", a[i];
      } else if (line ~ /^shared=/) {
        sub(/^shared=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--share=%s\n", a[i];
      } else if (line ~ /^system-bus=/) {
        sub(/^system-bus=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--system-talk-name=%s\n", a[i];
      } else if (line ~ /^session-bus=/) {
        sub(/^session-bus=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--talk-name=%s\n", a[i];
      } else if (line ~ /^env=/) {
        sub(/^env=/,"",line); n=split(line,a,/[;,]/);
        for(i=1;i<=n;i++){ split(a[i],kv,/=/); if(kv[1]!="") printf "--env=%s=%s\n", kv[1], kv[2]; }
      }
    }
  ' "$f" | sed '/^$/d' > "/tmp/.fpflags.$app"

  # Apply at user scope
  if [ -s "/tmp/.fpflags.$app" ]; then
    mapfile -t FLAGS < "/tmp/.fpflags.$app"
    "${CLEAN_ENV[@]}" flatpak override --user "${FLAGS[@]}" "$app"
    echo "applied overrides → $app"
  else
    echo "no overrides to apply for $app"
  fi
  rm -f "/tmp/.fpflags.$app"
}

export -f apply_app
for p in "$BASE"/*.perms; do
  [ -e "$p" ] || { echo "no *.perms found in $BASE"; exit 0; }
  app="$(basename "$p" .perms)"
  apply_app "$app"
done
#+END_SRC

* Flatpak Bridge
** Flatpak ↔ Host fonts (conf.d)
#+BEGIN_SRC xml :tangle linux/.config/fontconfig/conf.d/50-run-host-font-dirs.conf
<?xml version='1.0'?>
<!DOCTYPE fontconfig SYSTEM 'urn:fontconfig:fonts.dtd'>
<fontconfig>
  <!-- User fonts via XDG (resolves to $HOME/.local/share/fonts in sandbox) -->
  <dir prefix="xdg">fonts</dir>
  <!-- Legacy per-user dir (harmless if absent) -->
  <dir>~/.fonts</dir>

  <!-- Host system fonts (via /run/host bridge) -->
  <dir>/run/host/usr/share/fonts</dir>
  <dir>/run/host/usr/local/share/fonts</dir>
</fontconfig>
#+END_SRC

** Flatpak global fontconfig (versioned in repo)
#+BEGIN_SRC xml :tangle linux/.flatpak/fontconfig/fonts.conf
<?xml version="1.0"?>
<!DOCTYPE fontconfig SYSTEM "urn:fontconfig:fonts.dtd">
<fontconfig>
  <!-- write caches inside the sandbox XDG cache -->
  <cachedir prefix="xdg">fontconfig</cachedir>

  <!-- user fonts inside sandbox -->
  <dir prefix="xdg">fonts</dir>
  <dir>~/.local/share/fonts</dir>

  <!-- host fonts via Flatpak bridge -->
  <dir>/run/host/usr/local/share/fonts</dir>
  <dir>/run/host/usr/share/fonts</dir>
</fontconfig>
#+END_SRC

** Flatpak desktop bridge — repo-first, idempotent (script)
#+BEGIN_SRC sh :tangle linux/.local/bin/flatpak-desktop-bridge :tangle-mode (identity #o755)
#!/usr/bin/env bash
set -euo pipefail

HOME_FC="$HOME/.flatpak/fontconfig/fonts.conf"   # ← stowed symlink target

# Validate (non-fatal if xmllint missing)
file -b --mime-encoding "$HOME_FC" >/dev/null 2>&1 || true
xmllint --noout "$HOME_FC" >/dev/null 2>&1 || true

# Allow caches (global or per-app later)
flatpak override --user --persist=".cache/fontconfig"

# Read-only bindings the sandboxes need
flatpak override --user \
  --filesystem="$HOME/.local/share/fonts:ro" \
  --filesystem="$HOME/.config/fontconfig:ro" \
  --filesystem="/run/host/usr/share/fonts:ro" \
  --filesystem="/run/host/usr/local/share/fonts:ro" \
  --filesystem="/run/host/etc/fonts:ro" \
  --filesystem="$HOME/.icons:ro" \
  --filesystem="$HOME/.local/share/icons:ro"

# Point fontconfig at the **HOME** path (stowed symlink)
flatpak override --user --env=FONTCONFIG_FILE="$HOME_FC"

# Cursor search path:
# - If XCURSOR_PATH is already set in the host env, extend it with /run/host
# - Otherwise, fall back to a sane default based on HOME + host icon dirs
if [ "${XCURSOR_PATH-}" != "" ]; then
  XCURSOR_PATH_VALUE="${XCURSOR_PATH}:/run/host/usr/local/share/icons:/run/host/usr/share/icons"
else
  XCURSOR_PATH_VALUE="$HOME/.icons:$HOME/.local/share/icons:/run/host/usr/local/share/icons:/run/host/usr/share/icons"
fi

flatpak override --user --env=XCURSOR_PATH="$XCURSOR_PATH_VALUE"

# Hygiene
flatpak override --user --unset-env=LD_PRELOAD

echo "✅ Flatpak bridge bound to HOME symlink:"
echo "   FONTCONFIG_FILE=$HOME_FC"
echo "   XCURSOR_PATH=$XCURSOR_PATH_VALUE"
#+END_SRC

** Flatpak desktop bridge — reset (optional)
#+BEGIN_SRC sh :tangle linux/.local/bin/flatpak-desktop-bridge-reset :tangle-mode (identity #o755)
#!/usr/bin/env bash
set -euo pipefail
# Reset app-specific overrides (keep global unless you also reset without args)
flatpak override --user --reset md.obsidian.Obsidian || true
flatpak override --user --reset one.ablaze.floorp   || true
# To nuke *all* user overrides, uncomment:
# flatpak override --user --reset
echo "🧹 Flatpak per-app overrides reset."
#+END_SRC

* Flatpak font cache refresher
#+BEGIN_SRC sh :tangle linux/.local/bin/flatpak-fontcache-refresh :tangle-mode (identity #o755)
#!/usr/bin/env bash
set -euo pipefail
apps=(
  org.garudalinux.firedragon
  one.ablaze.floorp
  org.wezfurlong.wezterm
)
for app in "${apps[@]}"; do
  echo ">> refreshing fontconfig cache inside $app"
  flatpak run --command=sh "$app" -lc \
    'fc-cache -fv $HOME/.local/share/fonts $HOME/.fonts /run/host/usr/local/share/fonts /run/host/usr/share/fonts'
done
echo "✅ done"
#+END_SRC

** Orchestrate (Elisp) — emit files and scripts (optional helper)
#+name: flatpak-bridge-orchestrate
#+BEGIN_SRC emacs-lisp :results silent
;; You can run this block to ensure the four blocks above have been tangled.
;; It does not replace tangling; it's a safety net if you want to call it directly.
(message "Flatpak bridge: use `make bridge-flatpak` or run tangle + stow + script.")
#+END_SRC

** VSCodium Flatpak host-bridge
#+name: codium-host
#+BEGIN_SRC sh :tangle linux/.local/bin/codium-host :mkdirp yes :shebang "#!/usr/bin/env bash"
# ~/.local/bin/codium-host
#!/usr/bin/env bash
set -euo pipefail

APPID="com.vscodium.codium"

cfg_candidates=("$HOME/.config/VSCodium" "$HOME/.config/Code - OSS" "$HOME/.config/Code")
CONFIG_ROOT=""
for d in "${cfg_candidates[@]}"; do [ -d "$d" ] && CONFIG_ROOT="$d" && break; done
[ -n "$CONFIG_ROOT" ] || { echo "No config root found." >&2; exit 1; }

# Dynamic, no hardcoding. Allow override via env if you ever want it.
EXT_DIR="${VSCODE_EXTENSIONS_DIR:-$HOME/.vscode-oss/extensions}"

extra_flags=()
# Add X11 only if not already present in argv.json and not passed on CLI
argv_json="$CONFIG_ROOT/argv.json"
if [ ! -f "$argv_json" ] || ! grep -q '"ozone-platform"' "$argv_json"; then
  if ! printf '%s\n' "$@" | grep -q -- '--ozone-platform='; then
    extra_flags+=(--ozone-platform=x11)
  fi
fi

# Only clear LD_PRELOAD if it contains nocsd, otherwise leave your env alone
extra_env=(
  --env=PATH="$HOME/.guix-extra-profiles/core/core/bin:/usr/bin:/app/bin"
)
if [ "${LD_PRELOAD-}" != "" ] && printf '%s' "$LD_PRELOAD" | grep -q 'libgtk3-nocsd'; then
  extra_env+=(--env=LD_PRELOAD=)
fi

# Optional env scrubs if you ever see WebView crashes again. Leave commented unless needed.
# ENV_EXTRA=(
#   --env=GIO_MODULE_DIR=
#   --env=GIO_EXTRA_MODULES=
#   --env=GI_TYPELIB_PATH=
#   --env=LD_LIBRARY_PATH=
#   --env=GTK_PATH=
#   --env=GTK_IM_MODULE=
#   --env=QT_QPA_PLATFORMTHEME=
#   --env=QT_PLUGIN_PATH=
#   --env=QT_STYLE_OVERRIDE=
#   --env=XDG_DATA_DIRS=/usr/share:/app/share
#   --env=XDG_CONFIG_DIRS=/etc/xdg
# )

exec flatpak run \
  "${extra_env[@]}" \
  "$APPID" \
  --user-data-dir="$CONFIG_ROOT" \
  --extensions-dir="$EXT_DIR" \
  "${extra_flags[@]}" \
  "$@"
#+END_SRC

** Link Codium sandbox nvim -> repo nvim
#+name: codium-nvim-link
#+BEGIN_SRC sh :tangle linux/.local/bin/codium-nvim-link :mkdirp yes :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

APPID="com.vscodium.codium"
SBX_CFG="$HOME/.var/app/$APPID/config/nvim"
REPO_CFG="$HOME/DotCortex/all/.config/nvim"

if [ ! -d "$REPO_CFG" ]; then
  echo "Repo nvim not found: $REPO_CFG" >&2
  exit 1
fi

if [ -L "$SBX_CFG" ]; then
  # already a symlink
  tgt="$(readlink -f "$SBX_CFG")"
  if [ "$tgt" = "$REPO_CFG" ]; then
    echo "Already linked: $SBX_CFG -> $REPO_CFG"
    exit 0
  else
    echo "Different symlink at $SBX_CFG, refusing to overwrite." >&2
    exit 1
  fi
elif [ -e "$SBX_CFG" ]; then
  # real dir or file exists, back it up once
  ts=$(date +%Y%m%d-%H%M%S)
  echo "Backing up $SBX_CFG -> ${SBX_CFG}.bak.$ts"
  mv "$SBX_CFG" "${SBX_CFG}.bak.$ts"
fi

mkdir -p "$(dirname "$SBX_CFG")"
ln -sT "$REPO_CFG" "$SBX_CFG"
echo "Linked: $SBX_CFG -> $REPO_CFG"
#+END_SRC

** VSCodium: install LainCore theme (local extension)
#+name: codium-theme-bridge
#+BEGIN_SRC sh :tangle linux/.local/bin/codium-theme-bridge :mkdirp yes :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

EXTROOT="$HOME/.vscode-oss/extensions"
PKG="metsatron.laincore-theme"
VER="0.0.1"
EXTDIR="$EXTROOT/$PKG-$VER"
THEMES="$EXTDIR/themes"

# Prefer repo source; fall back to the user path if needed.
SRC_REPO="$HOME/DotCortex/all/.config/VSCodium/User/laincore-theme.json"
SRC_USER="$HOME/.config/VSCodium/User/laincore-theme.json"
SRC=""
if [ -f "$SRC_REPO" ]; then SRC="$SRC_REPO"
elif [ -f "$SRC_USER" ]; then SRC="$SRC_USER"
else
  echo "Theme JSON not found at $SRC_REPO or $SRC_USER" >&2
  exit 1
fi

mkdir -p "$THEMES"

# Symlink into extension
ln -sfn "$SRC" "$THEMES/laincore-color-theme.json"

# Minimal package.json
cat > "$EXTDIR/package.json" <<'JSON'
{
  "name": "laincore-theme",
  "displayName": "LainCore",
  "publisher": "metsatron",
  "version": "0.0.1",
  "engines": { "vscode": "^1.60.0" },
  "categories": ["Themes"],
  "contributes": {
    "themes": [
      { "label": "LainCore", "uiTheme": "vs-dark", "path": "./themes/laincore-color-theme.json" }
    ]
  }
}
JSON

echo "LainCore theme extension ready at: $EXTDIR"
echo "→ JSON source: $SRC"
#+END_SRC

* Betterbird - reuse host Thunderbird profile
Use the host =~/.thunderbird= directly from the Betterbird Flatpak, without copying into =~/.var/app=.
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-betterbird-profile-bridge :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

PROFILE_DIR="$HOME/.thunderbird"
APP_ID="eu.betterbird.Betterbird"

if [ ! -d "$PROFILE_DIR" ]; then
  echo "No $PROFILE_DIR found" >&2
  exit 1
fi

echo "Granting $APP_ID access to $PROFILE_DIR"
flatpak override --user --filesystem="$PROFILE_DIR" "$APP_ID"

echo "Clearing mesa_glthread for $APP_ID"
flatpak override --user --env=mesa_glthread= "$APP_ID"

echo "Done."
echo
echo "If this is your first time pointing Betterbird at this profile, run:"
echo
echo "  flatpak run eu.betterbird.Betterbird -P"
echo
echo "and pick the existing profile, then set it as default."
#+END_SRC

