linux/.local/bin/flatpak-betterbird-profile-bridge
#!/usr/bin/env bash
# Betterbird - reuse host Thunderbird profile
# Use the host =~/.thunderbird= directly from the Betterbird Flatpak, without copying into =~/.var/app=.

# [[file:../../../flatpak.org::*Betterbird - reuse host Thunderbird profile][Betterbird - reuse host Thunderbird profile:1]]
#!/usr/bin/env bash
set -euo pipefail

PROFILE_DIR="$HOME/.thunderbird"
APP_ID="eu.betterbird.Betterbird"

if [ ! -d "$PROFILE_DIR" ]; then
  echo "No $PROFILE_DIR found" >&2
  exit 1
fi

echo "Granting $APP_ID access to $PROFILE_DIR"
flatpak override --user --filesystem="$PROFILE_DIR" "$APP_ID"

echo "Clearing mesa_glthread for $APP_ID"
flatpak override --user --env=mesa_glthread= "$APP_ID"

echo "Done."
echo
echo "If this is your first time pointing Betterbird at this profile, run:"
echo
echo "  flatpak run eu.betterbird.Betterbird -P"
echo
echo "and pick the existing profile, then set it as default."
# Betterbird - reuse host Thunderbird profile:1 ends here
