linux/.local/bin/flatpak-perms-apply
#!/usr/bin/env bash
# Apply script (maps the common fields → flatpak override)

# [[file:../../../flatpak.org::*Apply script (maps the common fields → flatpak override)][Apply script (maps the common fields → flatpak override):1]]
set -euo pipefail
BASE="${HOME}/DotCortex/linux/.flatpak/overrides-perms"

CLEAN_ENV=(env -i HOME="$HOME" PATH="/usr/sbin:/usr/bin:/bin"
  LANG="${LANG:-C.UTF-8}" LC_ALL="${LC_ALL:-C.UTF-8}" TERM="${TERM:-xterm-256color}"
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}")

apply_app(){
  local app="$1" f="$BASE/$1.perms"
  [ -f "$f" ] || { echo "skip $app (no $f)"; return 0; }

  # Build override flags from sections
  awk -v app="$app" '
    function splitcsv(s, arr){ gsub(/ /,"",s); n=split(s,arr,/[,;]/); return n }
    BEGIN{ sec=""; }
    /^\[/ { gsub(/[\[\]]/,""); sec=$0; next }
    /^[[:space:]]*$/ { next }
    { line=$0 }
    sec=="Context" {
      if (line ~ /^sockets=/) {
        sub(/^sockets=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--socket=%s\n", a[i];
      } else if (line ~ /^devices=/) {
        sub(/^devices=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--device=%s\n", a[i];
      } else if (line ~ /^filesystems=/) {
        sub(/^filesystems=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--filesystem=%s\n", a[i];
      } else if (line ~ /^persistent=/) {
        sub(/^persistent=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--persist=%s\n", a[i];
      } else if (line ~ /^features=/) {
        sub(/^features=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--enable-features=%s\n", a[i];
      } else if (line ~ /^shared=/) {
        sub(/^shared=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--share=%s\n", a[i];
      } else if (line ~ /^system-bus=/) {
        sub(/^system-bus=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--system-talk-name=%s\n", a[i];
      } else if (line ~ /^session-bus=/) {
        sub(/^session-bus=/,"",line); n=splitcsv(line,a); for(i=1;i<=n;i++) printf "--talk-name=%s\n", a[i];
      } else if (line ~ /^env=/) {
        sub(/^env=/,"",line); n=split(line,a,/[;,]/);
        for(i=1;i<=n;i++){ split(a[i],kv,/=/); if(kv[1]!="") printf "--env=%s=%s\n", kv[1], kv[2]; }
      }
    }
  ' "$f" | sed '/^$/d' > "/tmp/.fpflags.$app"

  # Apply at user scope
  if [ -s "/tmp/.fpflags.$app" ]; then
    mapfile -t FLAGS < "/tmp/.fpflags.$app"
    "${CLEAN_ENV[@]}" flatpak override --user "${FLAGS[@]}" "$app"
    echo "applied overrides → $app"
  else
    echo "no overrides to apply for $app"
  fi
  rm -f "/tmp/.fpflags.$app"
}

export -f apply_app
for p in "$BASE"/*.perms; do
  [ -e "$p" ] || { echo "no *.perms found in $BASE"; exit 0; }
  app="$(basename "$p" .perms)"
  apply_app "$app"
done
# Apply script (maps the common fields → flatpak override):1 ends here
