flatpak.org
** PCSX2 Flatpak → host config bridge
#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-pcsx2-config-bridge :mkdirp yes :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

APP_ID="net.pcsx2.PCSX2"
HOST_CFG="$HOME/.config/PCSX2"
SANDBOX_CFG_BASE="$HOME/.var/app/$APP_ID/config"
SANDBOX_CFG="$SANDBOX_CFG_BASE/PCSX2"

echo "Granting $APP_ID access to $HOST_CFG"
flatpak override --user --filesystem="$HOST_CFG:create" "$APP_ID"

mkdir -p "$SANDBOX_CFG_BASE"

if [ -e "$SANDBOX_CFG" ] && [ ! -L "$SANDBOX_CFG" ]; then
  ts=$(date +%Y%m%d-%H%M%S)
  backup="${SANDBOX_CFG}.bak.$ts"
  echo "Existing sandbox config found, backing up:"
  echo "  $SANDBOX_CFG -> $backup"
  mv "$SANDBOX_CFG" "$backup"
fi

if [ ! -e "$SANDBOX_CFG" ]; then
  echo "Linking sandbox config to host config:"
  echo "  $SANDBOX_CFG -> $HOST_CFG"
  ln -s "$HOST_CFG" "$SANDBOX_CFG"
else
  echo "Sandbox config already links to something, leaving it as is:"
  ls -ld "$SANDBOX_CFG"
fi

echo
echo "Done."
echo
echo "From now on, $APP_ID will use:"
echo "  sandbox path  = $SANDBOX_CFG"
echo "  which points to= $HOST_CFG"
echo
echo "Next steps:"
echo "  1. Run: flatpak run $APP_ID"
echo "  2. Check BIOS, memcards, and paths - they should match ~/.config/PCSX2"
#+END_SRC

** Ungoogled Chromium Flatpak -> host (AppImage) profile bridge
Reuse the host Chromium profile at ~/.config/chromium (XDG) instead of ~/.var/app/...

#+BEGIN_SRC bash :tangle linux/.local/bin/flatpak-ungoogled-chromium-profile-bridge :tangle-mode (identity #o755) :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -euo pipefail

APP_ID="io.github.ungoogled_software.ungoogled_chromium"

# Host profile root. This is the folder that contains "Default/", "Local State", etc.
HOST_CFG_BASE="${XDG_CONFIG_HOME:-$HOME/.config}"
HOST_PROFILE="${HOST_PROFILE_DIR:-$HOST_CFG_BASE/chromium}"

SBX_CFG_BASE="$HOME/.var/app/$APP_ID/config"
SBX_PROFILE="$SBX_CFG_BASE/chromium"

if [ ! -d "$HOST_PROFILE" ]; then
  echo "Host profile dir not found: $HOST_PROFILE" >&2
  echo "Tip: confirm AppImage profile root, it should contain 'Default/' and 'Local State'." >&2
  exit 1
fi

if [ ! -d "$HOST_PROFILE/Default" ] && [ ! -f "$HOST_PROFILE/Local State" ]; then
  echo "Host profile dir exists but doesn't look like a Chromium profile root:" >&2
  echo "  $HOST_PROFILE" >&2
  echo "Expected either $HOST_PROFILE/Default/ or $HOST_PROFILE/Local State" >&2
  exit 1
fi

echo "Granting $APP_ID access to host profile:"
echo "  $HOST_PROFILE"

# Reproducible permission override: host XDG config chromium
flatpak override --user --filesystem="xdg-config/chromium:create" "$APP_ID"

# If you want cache/state on host too, uncomment:
# flatpak override --user --filesystem="xdg-cache/chromium:create" "$APP_ID"
# flatpak override --user --filesystem="xdg-state/chromium:create" "$APP_ID"

mkdir -p "$SBX_CFG_BASE"

# Resolve absolute target to reduce weirdness
HOST_PROFILE_REAL="$(readlink -f "$HOST_PROFILE")"

if [ -L "$SBX_PROFILE" ]; then
  tgt="$(readlink -f "$SBX_PROFILE" || true)"
  if [ "$tgt" = "$HOST_PROFILE_REAL" ]; then
    echo "Already linked:"
    echo "  $SBX_PROFILE -> $HOST_PROFILE_REAL"
    exit 0
  fi
  echo "Different symlink exists, refusing to overwrite:" >&2
  ls -ld "$SBX_PROFILE" >&2
  exit 1
fi

if [ -e "$SBX_PROFILE" ]; then
  ts="$(date +%Y%m%d-%H%M%S)"
  backup="${SBX_PROFILE}.bak.$ts"
  echo "Existing sandbox profile found, backing up:"
  echo "  $SBX_PROFILE -> $backup"
  mv "$SBX_PROFILE" "$backup"
fi

echo "Linking sandbox profile to host profile:"
echo "  $SBX_PROFILE -> $HOST_PROFILE_REAL"
ln -sT "$HOST_PROFILE_REAL" "$SBX_PROFILE"

echo
echo "Done."
echo "Next:"
echo "  1) Make sure the AppImage is not running (Chromium profiles lock)."
echo "  2) Run: flatpak run $APP_ID"
echo "  3) Visit chrome://version and confirm Profile Path."
#+END_SRC


* Usage
1. Tangle and stow:
#+BEGIN_SRC sh
make tangle && cd ~/DotCortex && stow all linux debian x230
#+END_SRC

2. See plan:
#+BEGIN_SRC sh
make -f all/.mk/flatpak.mk flatpak-diff
#+END_SRC

3. Additive sync:
#+BEGIN_SRC sh
make -f all/.mk/flatpak.mk flatpak-sync
#+END_SRC

4. Enforce exact state, allowing removals:
#+BEGIN_SRC sh
ENFORCE=1 UNINSTALL=1 make -f all/.mk/flatpak.mk flatpak-apply
# In a TTY without Polkit:
FORCE_SUDO_SYSTEM=1 ENFORCE=1 UNINSTALL=1 make -f all/.mk/flatpak.mk flatpak-apply
#+END_SRC

5. Capture any ad hoc installs back into git:
#+BEGIN_SRC sh
make -f all/.mk/flatpak.mk flatpak-capture
git add linux/.flatpak/manifest/apps.ssv && git commit -m "Update Flatpak manifest"
#+END_SRC

* Note on the earlier tangle error
This file sets =#+PROPERTY: header-args:text :comments no= so =text= blocks tangle cleanly even if your global defaults use =:comments both=. Bash and Makefile blocks keep your normal comment behavior.
