linux/.local/bin/flatpak-pcsx2-config-bridge
#!/usr/bin/env bash
# PCSX2 Flatpak → host config bridge

# [[file:../../../flatpak.org::*PCSX2 Flatpak → host config bridge][PCSX2 Flatpak → host config bridge:1]]
#!/usr/bin/env bash
set -euo pipefail

APP_ID="net.pcsx2.PCSX2"
HOST_CFG="$HOME/.config/PCSX2"
SANDBOX_CFG_BASE="$HOME/.var/app/$APP_ID/config"
SANDBOX_CFG="$SANDBOX_CFG_BASE/PCSX2"

echo "Granting $APP_ID access to $HOST_CFG"
flatpak override --user --filesystem="$HOST_CFG:create" "$APP_ID"

mkdir -p "$SANDBOX_CFG_BASE"

if [ -e "$SANDBOX_CFG" ] && [ ! -L "$SANDBOX_CFG" ]; then
  ts=$(date +%Y%m%d-%H%M%S)
  backup="${SANDBOX_CFG}.bak.$ts"
  echo "Existing sandbox config found, backing up:"
  echo "  $SANDBOX_CFG -> $backup"
  mv "$SANDBOX_CFG" "$backup"
fi

if [ ! -e "$SANDBOX_CFG" ]; then
  echo "Linking sandbox config to host config:"
  echo "  $SANDBOX_CFG -> $HOST_CFG"
  ln -s "$HOST_CFG" "$SANDBOX_CFG"
else
  echo "Sandbox config already links to something, leaving it as is:"
  ls -ld "$SANDBOX_CFG"
fi

echo
echo "Done."
echo
echo "From now on, $APP_ID will use:"
echo "  sandbox path  = $SANDBOX_CFG"
echo "  which points to= $HOST_CFG"
echo
echo "Next steps:"
echo "  1. Run: flatpak run $APP_ID"
echo "  2. Check BIOS, memcards, and paths - they should match ~/.config/PCSX2"
# PCSX2 Flatpak → host config bridge:1 ends here
