linux/.local/bin/flatpak-ungoogled-chromium-profile-bridge
#!/usr/bin/env bash
# Ungoogled Chromium Flatpak -> host (AppImage) profile bridge
# Reuse the host Chromium profile at ~/.config/chromium (XDG) instead of ~/.var/app/...


# [[file:../../../flatpak.org::*Ungoogled Chromium Flatpak -> host (AppImage) profile bridge][Ungoogled Chromium Flatpak -> host (AppImage) profile bridge:1]]
#!/usr/bin/env bash
set -euo pipefail

APP_ID="io.github.ungoogled_software.ungoogled_chromium"

# Host profile root. This is the folder that contains "Default/", "Local State", etc.
HOST_CFG_BASE="${XDG_CONFIG_HOME:-$HOME/.config}"
HOST_PROFILE="${HOST_PROFILE_DIR:-$HOST_CFG_BASE/chromium}"

SBX_CFG_BASE="$HOME/.var/app/$APP_ID/config"
SBX_PROFILE="$SBX_CFG_BASE/chromium"

if [ ! -d "$HOST_PROFILE" ]; then
  echo "Host profile dir not found: $HOST_PROFILE" >&2
  echo "Tip: confirm AppImage profile root, it should contain 'Default/' and 'Local State'." >&2
  exit 1
fi

if [ ! -d "$HOST_PROFILE/Default" ] && [ ! -f "$HOST_PROFILE/Local State" ]; then
  echo "Host profile dir exists but doesn't look like a Chromium profile root:" >&2
  echo "  $HOST_PROFILE" >&2
  echo "Expected either $HOST_PROFILE/Default/ or $HOST_PROFILE/Local State" >&2
  exit 1
fi

echo "Granting $APP_ID access to host profile:"
echo "  $HOST_PROFILE"

# Reproducible permission override: host XDG config chromium
flatpak override --user --filesystem="xdg-config/chromium:create" "$APP_ID"

# If you want cache/state on host too, uncomment:
# flatpak override --user --filesystem="xdg-cache/chromium:create" "$APP_ID"
# flatpak override --user --filesystem="xdg-state/chromium:create" "$APP_ID"

mkdir -p "$SBX_CFG_BASE"

# Resolve absolute target to reduce weirdness
HOST_PROFILE_REAL="$(readlink -f "$HOST_PROFILE")"

if [ -L "$SBX_PROFILE" ]; then
  tgt="$(readlink -f "$SBX_PROFILE" || true)"
  if [ "$tgt" = "$HOST_PROFILE_REAL" ]; then
    echo "Already linked:"
    echo "  $SBX_PROFILE -> $HOST_PROFILE_REAL"
    exit 0
  fi
  echo "Different symlink exists, refusing to overwrite:" >&2
  ls -ld "$SBX_PROFILE" >&2
  exit 1
fi

if [ -e "$SBX_PROFILE" ]; then
  ts="$(date +%Y%m%d-%H%M%S)"
  backup="${SBX_PROFILE}.bak.$ts"
  echo "Existing sandbox profile found, backing up:"
  echo "  $SBX_PROFILE -> $backup"
  mv "$SBX_PROFILE" "$backup"
fi

echo "Linking sandbox profile to host profile:"
echo "  $SBX_PROFILE -> $HOST_PROFILE_REAL"
ln -sT "$HOST_PROFILE_REAL" "$SBX_PROFILE"

echo
echo "Done."
echo "Next:"
echo "  1) Make sure the AppImage is not running (Chromium profiles lock)."
echo "  2) Run: flatpak run $APP_ID"
echo "  3) Visit chrome://version and confirm Profile Path."
# Ungoogled Chromium Flatpak -> host (AppImage) profile bridge:1 ends here
